zephyrproject-rtos/hal_nxp/dts/nxp/s32/S32K344-172MQFP-pinctrl.h
/* LCU0 */
#define PTA0_LCU0_OUT4                  NXP_S32_PINMUX(0, 0, 3, 0, 0)
#define PTA1_LCU0_OUT5                  NXP_S32_PINMUX(0, 1, 5, 0, 0)
#define PTA2_LCU0_OUT3                  NXP_S32_PINMUX(0, 2, 6, 0, 0)
#define PTA3_LCU0_OUT2                  NXP_S32_PINMUX(0, 3, 4, 0, 0)
#define PTB8_LCU0_OUT11                 NXP_S32_PINMUX(0, 40, 5, 0, 0)
#define PTB9_LCU0_OUT10                 NXP_S32_PINMUX(0, 41, 6, 0, 0)
#define PTB10_LCU0_OUT9                 NXP_S32_PINMUX(0, 42, 6, 0, 0)
#define PTB11_LCU0_OUT8                 NXP_S32_PINMUX(0, 43, 5, 0, 0)
#define PTB12_LCU0_OUT2                 NXP_S32_PINMUX(0, 44, 6, 0, 0)
#define PTB13_LCU0_OUT3                 NXP_S32_PINMUX(0, 45, 5, 0, 0)
#define PTB14_LCU0_OUT7                 NXP_S32_PINMUX(0, 46, 4, 0, 0)
#define PTC6_LCU0_OUT7                  NXP_S32_PINMUX(0, 70, 4, 0, 0)
#define PTC7_LCU0_OUT6                  NXP_S32_PINMUX(0, 71, 4, 0, 0)
#define PTD2_LCU0_OUT1                  NXP_S32_PINMUX(0, 98, 1, 0, 0)
#define PTD3_LCU0_OUT0                  NXP_S32_PINMUX(0, 99, 6, 0, 0)
#define PTD4_LCU0_OUT6                  NXP_S32_PINMUX(0, 100, 5, 0, 0)
#define PTD21_LCU0_OUT4                 NXP_S32_PINMUX(0, 117, 5, 0, 0)
#define PTD22_LCU0_OUT5                 NXP_S32_PINMUX(0, 118, 6, 0, 0)
#define PTD23_LCU0_OUT10                NXP_S32_PINMUX(0, 119, 6, 0, 0)
#define PTD24_LCU0_OUT11                NXP_S32_PINMUX(0, 120, 6, 0, 0)
#define PTD26_LCU0_OUT0                 NXP_S32_PINMUX(0, 122, 7, 0, 0)
#define PTD27_LCU0_OUT1                 NXP_S32_PINMUX(0, 123, 7, 0, 0)
#define PTD28_LCU0_OUT2                 NXP_S32_PINMUX(0, 124, 5, 0, 0)
#define PTD29_LCU0_OUT3                 NXP_S32_PINMUX(0, 125, 5, 0, 0)
#define PTD30_LCU0_OUT8                 NXP_S32_PINMUX(0, 126, 5, 0, 0)
#define PTD31_LCU0_OUT9                 NXP_S32_PINMUX(0, 127, 5, 0, 0)

/* FXIO */
#define PTA0_FXIO_D2_O                  NXP_S32_PINMUX(0, 0, 4, 0, 0)
#define PTA0_FXIO_D2_I                  NXP_S32_PINMUX(0, 0, 0, 154, 2)
#define PTA1_FXIO_D3_O                  NXP_S32_PINMUX(0, 1, 4, 0, 0)
#define PTA1_FXIO_D3_I                  NXP_S32_PINMUX(0, 1, 0, 155, 1)
#define PTA2_FXIO_D4_O                  NXP_S32_PINMUX(0, 2, 5, 0, 0)
#define PTA2_FXIO_D4_I                  NXP_S32_PINMUX(0, 2, 0, 156, 3)
#define PTA3_FXIO_D5_O                  NXP_S32_PINMUX(0, 3, 5, 0, 0)
#define PTA3_FXIO_D5_I                  NXP_S32_PINMUX(0, 3, 0, 157, 3)
#define PTA4_FXIO_D6_O                  NXP_S32_PINMUX(0, 4, 3, 0, 0)
#define PTA4_FXIO_D6_I                  NXP_S32_PINMUX(0, 4, 0, 158, 8)
#define PTA6_FXIO_D19_O                 NXP_S32_PINMUX(0, 6, 5, 0, 0)
#define PTA6_FXIO_D19_I                 NXP_S32_PINMUX(0, 6, 0, 171, 4)
#define PTA7_FXIO_D9_O                  NXP_S32_PINMUX(0, 7, 6, 0, 0)
#define PTA7_FXIO_D9_I                  NXP_S32_PINMUX(0, 7, 0, 161, 3)
#define PTA8_FXIO_D6_O                  NXP_S32_PINMUX(0, 8, 4, 0, 0)
#define PTA8_FXIO_D6_I                  NXP_S32_PINMUX(0, 8, 0, 158, 2)
#define PTA9_FXIO_D7_O                  NXP_S32_PINMUX(0, 9, 4, 0, 0)
#define PTA9_FXIO_D7_I                  NXP_S32_PINMUX(0, 9, 0, 159, 2)
#define PTA10_FXIO_D0_O                 NXP_S32_PINMUX(0, 10, 4, 0, 0)
#define PTA10_FXIO_D0_I                 NXP_S32_PINMUX(0, 10, 0, 152, 2)
#define PTA11_FXIO_D1_O                 NXP_S32_PINMUX(0, 11, 4, 0, 0)
#define PTA11_FXIO_D1_I                 NXP_S32_PINMUX(0, 11, 0, 153, 2)
#define PTA12_FXIO_D9_O                 NXP_S32_PINMUX(0, 12, 5, 0, 0)
#define PTA12_FXIO_D9_I                 NXP_S32_PINMUX(0, 12, 0, 161, 4)
#define PTA13_FXIO_D8_O                 NXP_S32_PINMUX(0, 13, 5, 0, 0)
#define PTA13_FXIO_D8_I                 NXP_S32_PINMUX(0, 13, 0, 160, 4)
#define PTA14_FXIO_D14_O                NXP_S32_PINMUX(0, 14, 6, 0, 0)
#define PTA14_FXIO_D14_I                NXP_S32_PINMUX(0, 14, 0, 166, 4)
#define PTA15_FXIO_D31_O                NXP_S32_PINMUX(0, 15, 7, 0, 0)
#define PTA15_FXIO_D31_I                NXP_S32_PINMUX(0, 15, 0, 183, 1)
#define PTA16_FXIO_D30_O                NXP_S32_PINMUX(0, 16, 7, 0, 0)
#define PTA16_FXIO_D30_I                NXP_S32_PINMUX(0, 16, 0, 182, 1)
#define PTA17_FXIO_D19_O                NXP_S32_PINMUX(0, 17, 7, 0, 0)
#define PTA17_FXIO_D19_I                NXP_S32_PINMUX(0, 17, 0, 171, 1)
#define PTA21_FXIO_D0_O                 NXP_S32_PINMUX(0, 21, 3, 0, 0)
#define PTA21_FXIO_D0_I                 NXP_S32_PINMUX(0, 21, 0, 152, 3)
#define PTA24_FXIO_D3                   NXP_S32_PINMUX(0, 23, 0, 155, 3)
#define PTA25_FXIO_D2                   NXP_S32_PINMUX(0, 23, 0, 154, 6)
#define PTA27_FXIO_D5_O                 NXP_S32_PINMUX(0, 27, 1, 0, 0)
#define PTA27_FXIO_D5_I                 NXP_S32_PINMUX(0, 27, 0, 157, 9)
#define PTA31_FXIO_D0_O                 NXP_S32_PINMUX(0, 31, 3, 0, 0)
#define PTA31_FXIO_D0_I                 NXP_S32_PINMUX(0, 31, 0, 152, 6)
#define PTB0_FXIO_D14_O                 NXP_S32_PINMUX(0, 32, 2, 0, 0)
#define PTB0_FXIO_D14_I                 NXP_S32_PINMUX(0, 32, 0, 166, 3)
#define PTB2_FXIO_D18_O                 NXP_S32_PINMUX(0, 34, 7, 0, 0)
#define PTB2_FXIO_D18_I                 NXP_S32_PINMUX(0, 34, 0, 170, 1)
#define PTB3_FXIO_D17_O                 NXP_S32_PINMUX(0, 35, 7, 0, 0)
#define PTB3_FXIO_D17_I                 NXP_S32_PINMUX(0, 35, 0, 169, 1)
#define PTB8_FXIO_D29_O                 NXP_S32_PINMUX(0, 40, 7, 0, 0)
#define PTB8_FXIO_D29_I                 NXP_S32_PINMUX(0, 40, 0, 181, 1)
#define PTB9_FXIO_D28_O                 NXP_S32_PINMUX(0, 41, 7, 0, 0)
#define PTB9_FXIO_D28_I                 NXP_S32_PINMUX(0, 41, 0, 180, 1)
#define PTB10_FXIO_D27_O                NXP_S32_PINMUX(0, 42, 7, 0, 0)
#define PTB10_FXIO_D27_I                NXP_S32_PINMUX(0, 42, 0, 179, 1)
#define PTB11_FXIO_D26_O                NXP_S32_PINMUX(0, 43, 7, 0, 0)
#define PTB11_FXIO_D26_I                NXP_S32_PINMUX(0, 43, 0, 178, 1)
#define PTB12_FXIO_D25_O                NXP_S32_PINMUX(0, 44, 7, 0, 0)
#define PTB12_FXIO_D25_I                NXP_S32_PINMUX(0, 44, 0, 177, 1)
#define PTB13_FXIO_D8_O                 NXP_S32_PINMUX(0, 45, 3, 0, 0)
#define PTB13_FXIO_D24_O                NXP_S32_PINMUX(0, 45, 7, 0, 0)
#define PTB13_FXIO_D8_I                 NXP_S32_PINMUX(0, 45, 0, 160, 3)
#define PTB13_FXIO_D24_I                NXP_S32_PINMUX(0, 45, 0, 176, 1)
#define PTB14_FXIO_D23_O                NXP_S32_PINMUX(0, 46, 7, 0, 0)
#define PTB14_FXIO_D23_I                NXP_S32_PINMUX(0, 46, 0, 175, 1)
#define PTB15_FXIO_D22_O                NXP_S32_PINMUX(0, 47, 7, 0, 0)
#define PTB15_FXIO_D22_I                NXP_S32_PINMUX(0, 47, 0, 174, 1)
#define PTB16_FXIO_D21_O                NXP_S32_PINMUX(0, 48, 7, 0, 0)
#define PTB16_FXIO_D21_I                NXP_S32_PINMUX(0, 48, 0, 173, 1)
#define PTB17_FXIO_D20_O                NXP_S32_PINMUX(0, 49, 7, 0, 0)
#define PTB17_FXIO_D20_I                NXP_S32_PINMUX(0, 49, 0, 172, 1)
#define PTB18_FXIO_D1_O                 NXP_S32_PINMUX(0, 50, 3, 0, 0)
#define PTB18_FXIO_D1_I                 NXP_S32_PINMUX(0, 50, 0, 153, 6)
#define PTB19_FXIO_D2_O                 NXP_S32_PINMUX(0, 51, 3, 0, 0)
#define PTB19_FXIO_D2_I                 NXP_S32_PINMUX(0, 51, 0, 154, 5)
#define PTB20_FXIO_D3_O                 NXP_S32_PINMUX(0, 52, 3, 0, 0)
#define PTB20_FXIO_D3_I                 NXP_S32_PINMUX(0, 52, 0, 155, 5)
#define PTB21_FXIO_D4_O                 NXP_S32_PINMUX(0, 53, 3, 0, 0)
#define PTB21_FXIO_D4_I                 NXP_S32_PINMUX(0, 53, 0, 156, 5)
#define PTB22_FXIO_D15_O                NXP_S32_PINMUX(0, 54, 6, 0, 0)
#define PTB22_FXIO_D15_I                NXP_S32_PINMUX(0, 54, 0, 167, 5)
#define PTB23_FXIO_D4_O                 NXP_S32_PINMUX(0, 55, 3, 0, 0)
#define PTB23_FXIO_D4_I                 NXP_S32_PINMUX(0, 55, 0, 156, 6)
#define PTB24_FXIO_D5_O                 NXP_S32_PINMUX(0, 56, 3, 0, 0)
#define PTB24_FXIO_D5_I                 NXP_S32_PINMUX(0, 56, 0, 157, 6)
#define PTB25_FXIO_D6_O                 NXP_S32_PINMUX(0, 57, 3, 0, 0)
#define PTB25_FXIO_D6_I                 NXP_S32_PINMUX(0, 57, 0, 158, 5)
#define PTB26_FXIO_D7_O                 NXP_S32_PINMUX(0, 58, 3, 0, 0)
#define PTB26_FXIO_D7_I                 NXP_S32_PINMUX(0, 58, 0, 159, 6)
#define PTB27_FXIO_D8_O                 NXP_S32_PINMUX(0, 59, 3, 0, 0)
#define PTB27_FXIO_D8_I                 NXP_S32_PINMUX(0, 59, 0, 160, 2)
#define PTB28_FXIO_D9_O                 NXP_S32_PINMUX(0, 60, 3, 0, 0)
#define PTB28_FXIO_D9_I                 NXP_S32_PINMUX(0, 60, 0, 161, 2)
#define PTB29_FXIO_D10_O                NXP_S32_PINMUX(0, 61, 3, 0, 0)
#define PTB29_FXIO_D10_I                NXP_S32_PINMUX(0, 61, 0, 162, 2)
#define PTC1_FXIO_D5_O                  NXP_S32_PINMUX(0, 65, 4, 0, 0)
#define PTC1_FXIO_D5_I                  NXP_S32_PINMUX(0, 65, 0, 157, 7)
#define PTC4_FXIO_D5_O                  NXP_S32_PINMUX(0, 68, 4, 0, 0)
#define PTC4_FXIO_D5_I                  NXP_S32_PINMUX(0, 68, 0, 157, 8)
#define PTC5_FXIO_D4_O                  NXP_S32_PINMUX(0, 69, 4, 0, 0)
#define PTC5_FXIO_D4_I                  NXP_S32_PINMUX(0, 69, 0, 156, 7)
#define PTC6_FXIO_D11_O                 NXP_S32_PINMUX(0, 70, 2, 0, 0)
#define PTC6_FXIO_D11_I                 NXP_S32_PINMUX(0, 70, 0, 163, 3)
#define PTC7_FXIO_D10_O                 NXP_S32_PINMUX(0, 71, 1, 0, 0)
#define PTC7_FXIO_D10_I                 NXP_S32_PINMUX(0, 71, 0, 162, 3)
#define PTC8_FXIO_D12_O                 NXP_S32_PINMUX(0, 72, 7, 0, 0)
#define PTC8_FXIO_D12_I                 NXP_S32_PINMUX(0, 72, 0, 164, 3)
#define PTC9_FXIO_D13_O                 NXP_S32_PINMUX(0, 73, 7, 0, 0)
#define PTC9_FXIO_D13_I                 NXP_S32_PINMUX(0, 73, 0, 165, 3)
#define PTC11_FXIO_D15_O                NXP_S32_PINMUX(0, 75, 4, 0, 0)
#define PTC11_FXIO_D19_O                NXP_S32_PINMUX(0, 75, 6, 0, 0)
#define PTC11_FXIO_D15_I                NXP_S32_PINMUX(0, 75, 0, 167, 3)
#define PTC11_FXIO_D19_I                NXP_S32_PINMUX(0, 75, 0, 171, 3)
#define PTC12_FXIO_D19_O                NXP_S32_PINMUX(0, 76, 5, 0, 0)
#define PTC12_FXIO_D19_I                NXP_S32_PINMUX(0, 76, 0, 171, 5)
#define PTC13_FXIO_D16_O                NXP_S32_PINMUX(0, 77, 5, 0, 0)
#define PTC13_FXIO_D16_I                NXP_S32_PINMUX(0, 77, 0, 168, 3)
#define PTC14_FXIO_D16_O                NXP_S32_PINMUX(0, 78, 7, 0, 0)
#define PTC14_FXIO_D16_I                NXP_S32_PINMUX(0, 78, 0, 168, 1)
#define PTC16_FXIO_D15_O                NXP_S32_PINMUX(0, 80, 6, 0, 0)
#define PTC16_FXIO_D15_I                NXP_S32_PINMUX(0, 80, 0, 167, 1)
#define PTC17_FXIO_D14_O                NXP_S32_PINMUX(0, 81, 6, 0, 0)
#define PTC17_FXIO_D14_I                NXP_S32_PINMUX(0, 81, 0, 166, 1)
#define PTC18_FXIO_D6_O                 NXP_S32_PINMUX(0, 82, 2, 0, 0)
#define PTC18_FXIO_D12_O                NXP_S32_PINMUX(0, 82, 3, 0, 0)
#define PTC18_FXIO_D6_I                 NXP_S32_PINMUX(0, 82, 0, 158, 9)
#define PTC18_FXIO_D12_I                NXP_S32_PINMUX(0, 82, 0, 164, 2)
#define PTC19_FXIO_D13_O                NXP_S32_PINMUX(0, 83, 3, 0, 0)
#define PTC19_FXIO_D13_I                NXP_S32_PINMUX(0, 83, 0, 165, 2)
#define PTC20_FXIO_D14_O                NXP_S32_PINMUX(0, 84, 3, 0, 0)
#define PTC20_FXIO_D14_I                NXP_S32_PINMUX(0, 84, 0, 166, 2)
#define PTC21_FXIO_D15_O                NXP_S32_PINMUX(0, 85, 3, 0, 0)
#define PTC21_FXIO_D15_I                NXP_S32_PINMUX(0, 85, 0, 167, 2)
#define PTC23_FXIO_D16_O                NXP_S32_PINMUX(0, 87, 3, 0, 0)
#define PTC23_FXIO_D16_I                NXP_S32_PINMUX(0, 87, 0, 168, 2)
#define PTC24_FXIO_D17_O                NXP_S32_PINMUX(0, 88, 3, 0, 0)
#define PTC24_FXIO_D17_I                NXP_S32_PINMUX(0, 88, 0, 169, 2)
#define PTC25_FXIO_D18_O                NXP_S32_PINMUX(0, 89, 3, 0, 0)
#define PTC25_FXIO_D18_I                NXP_S32_PINMUX(0, 89, 0, 170, 2)
#define PTC26_FXIO_D19_O                NXP_S32_PINMUX(0, 90, 3, 0, 0)
#define PTC26_FXIO_D19_I                NXP_S32_PINMUX(0, 90, 0, 171, 2)
#define PTC27_FXIO_D20_O                NXP_S32_PINMUX(0, 91, 3, 0, 0)
#define PTC27_FXIO_D20_I                NXP_S32_PINMUX(0, 91, 0, 172, 2)
#define PTC28_FXIO_D21_O                NXP_S32_PINMUX(0, 92, 3, 0, 0)
#define PTC28_FXIO_D2_O                 NXP_S32_PINMUX(0, 92, 4, 0, 0)
#define PTC28_FXIO_D2_I                 NXP_S32_PINMUX(0, 92, 0, 154, 7)
#define PTC28_FXIO_D21_I                NXP_S32_PINMUX(0, 92, 0, 173, 2)
#define PTC29_FXIO_D22_O                NXP_S32_PINMUX(0, 93, 3, 0, 0)
#define PTC29_FXIO_D3_O                 NXP_S32_PINMUX(0, 93, 7, 0, 0)
#define PTC29_FXIO_D3_I                 NXP_S32_PINMUX(0, 93, 0, 155, 6)
#define PTC29_FXIO_D22_I                NXP_S32_PINMUX(0, 93, 0, 174, 2)
#define PTC30_FXIO_D0_O                 NXP_S32_PINMUX(0, 94, 3, 0, 0)
#define PTC30_FXIO_D23_O                NXP_S32_PINMUX(0, 94, 7, 0, 0)
#define PTC30_FXIO_D0_I                 NXP_S32_PINMUX(0, 94, 0, 152, 4)
#define PTC30_FXIO_D23_I                NXP_S32_PINMUX(0, 94, 0, 175, 2)
#define PTC31_FXIO_D1_O                 NXP_S32_PINMUX(0, 95, 3, 0, 0)
#define PTC31_FXIO_D24_O                NXP_S32_PINMUX(0, 95, 7, 0, 0)
#define PTC31_FXIO_D1_I                 NXP_S32_PINMUX(0, 95, 0, 153, 4)
#define PTC31_FXIO_D24_I                NXP_S32_PINMUX(0, 95, 0, 176, 2)
#define PTD0_FXIO_D0_O                  NXP_S32_PINMUX(0, 96, 6, 0, 0)
#define PTD0_FXIO_D0_I                  NXP_S32_PINMUX(0, 96, 0, 152, 1)
#define PTD1_FXIO_D1_O                  NXP_S32_PINMUX(0, 97, 6, 0, 0)
#define PTD1_FXIO_D1_I                  NXP_S32_PINMUX(0, 97, 0, 153, 1)
#define PTD2_FXIO_D4_O                  NXP_S32_PINMUX(0, 98, 4, 0, 0)
#define PTD2_FXIO_D6_O                  NXP_S32_PINMUX(0, 98, 5, 0, 0)
#define PTD2_FXIO_D4_I                  NXP_S32_PINMUX(0, 98, 0, 156, 1)
#define PTD2_FXIO_D6_I                  NXP_S32_PINMUX(0, 98, 0, 158, 3)
#define PTD3_FXIO_D5_O                  NXP_S32_PINMUX(0, 99, 4, 0, 0)
#define PTD3_FXIO_D7_O                  NXP_S32_PINMUX(0, 99, 5, 0, 0)
#define PTD3_FXIO_D5_I                  NXP_S32_PINMUX(0, 99, 0, 157, 2)
#define PTD3_FXIO_D7_I                  NXP_S32_PINMUX(0, 99, 0, 159, 3)
#define PTD5_FXIO_D15_O                 NXP_S32_PINMUX(0, 101, 6, 0, 0)
#define PTD5_FXIO_D15_I                 NXP_S32_PINMUX(0, 101, 0, 167, 4)
#define PTD6_FXIO_D13_O                 NXP_S32_PINMUX(0, 102, 6, 0, 0)
#define PTD6_FXIO_D13_I                 NXP_S32_PINMUX(0, 102, 0, 165, 1)
#define PTD8_FXIO_D1_O                  NXP_S32_PINMUX(0, 104, 5, 0, 0)
#define PTD8_FXIO_D11_O                 NXP_S32_PINMUX(0, 104, 7, 0, 0)
#define PTD8_FXIO_D1_I                  NXP_S32_PINMUX(0, 104, 0, 153, 5)
#define PTD8_FXIO_D11_I                 NXP_S32_PINMUX(0, 104, 0, 163, 5)
#define PTD9_FXIO_D0_O                  NXP_S32_PINMUX(0, 105, 3, 0, 0)
#define PTD9_FXIO_D10_O                 NXP_S32_PINMUX(0, 105, 7, 0, 0)
#define PTD9_FXIO_D0_I                  NXP_S32_PINMUX(0, 105, 0, 152, 5)
#define PTD9_FXIO_D10_I                 NXP_S32_PINMUX(0, 105, 0, 162, 4)
#define PTD13_FXIO_D7_O                 NXP_S32_PINMUX(0, 109, 3, 0, 0)
#define PTD13_FXIO_D7_I                 NXP_S32_PINMUX(0, 109, 0, 159, 7)
#define PTD15_FXIO_D6_O                 NXP_S32_PINMUX(0, 111, 1, 0, 0)
#define PTD15_FXIO_D10_O                NXP_S32_PINMUX(0, 111, 7, 0, 0)
#define PTD15_FXIO_D6_I                 NXP_S32_PINMUX(0, 111, 0, 158, 7)
#define PTD15_FXIO_D10_I                NXP_S32_PINMUX(0, 111, 0, 162, 1)
#define PTD17_FXIO_D9_O                 NXP_S32_PINMUX(0, 113, 6, 0, 0)
#define PTD17_FXIO_D9_I                 NXP_S32_PINMUX(0, 113, 0, 161, 1)
#define PTD20_FXIO_D25_O                NXP_S32_PINMUX(0, 116, 3, 0, 0)
#define PTD20_FXIO_D25_I                NXP_S32_PINMUX(0, 116, 0, 177, 2)
#define PTD21_FXIO_D26_O                NXP_S32_PINMUX(0, 117, 3, 0, 0)
#define PTD21_FXIO_D26_I                NXP_S32_PINMUX(0, 117, 0, 178, 2)
#define PTD22_FXIO_D27_O                NXP_S32_PINMUX(0, 118, 3, 0, 0)
#define PTD22_FXIO_D27_I                NXP_S32_PINMUX(0, 118, 0, 179, 2)
#define PTD23_FXIO_D28_O                NXP_S32_PINMUX(0, 119, 3, 0, 0)
#define PTD23_FXIO_D28_I                NXP_S32_PINMUX(0, 119, 0, 180, 2)
#define PTD24_FXIO_D29_O                NXP_S32_PINMUX(0, 120, 3, 0, 0)
#define PTD24_FXIO_D29_I                NXP_S32_PINMUX(0, 120, 0, 181, 2)
#define PTD26_FXIO_D7_O                 NXP_S32_PINMUX(0, 122, 3, 0, 0)
#define PTD26_FXIO_D30_O                NXP_S32_PINMUX(0, 122, 5, 0, 0)
#define PTD26_FXIO_D7_I                 NXP_S32_PINMUX(0, 122, 0, 159, 4)
#define PTD26_FXIO_D30_I                NXP_S32_PINMUX(0, 122, 0, 182, 2)
#define PTD27_FXIO_D31_O                NXP_S32_PINMUX(0, 123, 5, 0, 0)
#define PTD27_FXIO_D31_I                NXP_S32_PINMUX(0, 123, 0, 183, 2)
#define PTD31_FXIO_D6_O                 NXP_S32_PINMUX(0, 127, 3, 0, 0)
#define PTD31_FXIO_D6_I                 NXP_S32_PINMUX(0, 127, 0, 158, 4)
#define PTE0_FXIO_D3_O                  NXP_S32_PINMUX(0, 128, 3, 0, 0)
#define PTE0_FXIO_D3_I                  NXP_S32_PINMUX(0, 128, 0, 155, 7)
#define PTE1_FXIO_D2_O                  NXP_S32_PINMUX(0, 129, 3, 0, 0)
#define PTE1_FXIO_D2_I                  NXP_S32_PINMUX(0, 129, 0, 154, 8)
#define PTE2_FXIO_D13_O                 NXP_S32_PINMUX(0, 130, 6, 0, 0)
#define PTE2_FXIO_D13_I                 NXP_S32_PINMUX(0, 130, 0, 165, 4)
#define PTE3_FXIO_D6_O                  NXP_S32_PINMUX(0, 131, 4, 0, 0)
#define PTE3_FXIO_D6_I                  NXP_S32_PINMUX(0, 131, 0, 158, 6)
#define PTE4_FXIO_D6_O                  NXP_S32_PINMUX(0, 132, 6, 0, 0)
#define PTE4_FXIO_D6_I                  NXP_S32_PINMUX(0, 132, 0, 158, 1)
#define PTE5_FXIO_D7_O                  NXP_S32_PINMUX(0, 133, 6, 0, 0)
#define PTE5_FXIO_D7_I                  NXP_S32_PINMUX(0, 133, 0, 159, 1)
#define PTE6_FXIO_D12_O                 NXP_S32_PINMUX(0, 134, 6, 0, 0)
#define PTE6_FXIO_D12_I                 NXP_S32_PINMUX(0, 134, 0, 164, 4)
#define PTE7_FXIO_D11_O                 NXP_S32_PINMUX(0, 135, 7, 0, 0)
#define PTE7_FXIO_D11_I                 NXP_S32_PINMUX(0, 135, 0, 163, 4)
#define PTE8_FXIO_D12_O                 NXP_S32_PINMUX(0, 136, 4, 0, 0)
#define PTE8_FXIO_D8_O                  NXP_S32_PINMUX(0, 136, 7, 0, 0)
#define PTE8_FXIO_D8_I                  NXP_S32_PINMUX(0, 136, 0, 160, 5)
#define PTE8_FXIO_D12_I                 NXP_S32_PINMUX(0, 136, 0, 164, 1)
#define PTE9_FXIO_D11_O                 NXP_S32_PINMUX(0, 137, 7, 0, 0)
#define PTE9_FXIO_D11_I                 NXP_S32_PINMUX(0, 137, 0, 163, 1)
#define PTE10_FXIO_D4_O                 NXP_S32_PINMUX(0, 138, 6, 0, 0)
#define PTE10_FXIO_D4_I                 NXP_S32_PINMUX(0, 138, 0, 156, 2)
#define PTE11_FXIO_D5_O                 NXP_S32_PINMUX(0, 139, 6, 0, 0)
#define PTE11_FXIO_D5_I                 NXP_S32_PINMUX(0, 139, 0, 157, 1)
#define PTE12_FXIO_D8_O                 NXP_S32_PINMUX(0, 140, 6, 0, 0)
#define PTE12_FXIO_D8_I                 NXP_S32_PINMUX(0, 140, 0, 160, 1)
#define PTE13_FXIO_D5_O                 NXP_S32_PINMUX(0, 141, 6, 0, 0)
#define PTE13_FXIO_D5_I                 NXP_S32_PINMUX(0, 141, 0, 157, 5)
#define PTE14_FXIO_D7_O                 NXP_S32_PINMUX(0, 142, 6, 0, 0)
#define PTE14_FXIO_D7_I                 NXP_S32_PINMUX(0, 142, 0, 159, 5)
#define PTE15_FXIO_D2_O                 NXP_S32_PINMUX(0, 143, 6, 0, 0)
#define PTE15_FXIO_D2_I                 NXP_S32_PINMUX(0, 143, 0, 154, 1)
#define PTE16_FXIO_D3_O                 NXP_S32_PINMUX(0, 144, 6, 0, 0)
#define PTE16_FXIO_D3_I                 NXP_S32_PINMUX(0, 144, 0, 155, 2)
#define PTE17_FXIO_D5_O                 NXP_S32_PINMUX(0, 145, 3, 0, 0)
#define PTE17_FXIO_D5_I                 NXP_S32_PINMUX(0, 145, 0, 157, 4)
#define PTE18_FXIO_D4_O                 NXP_S32_PINMUX(0, 146, 3, 0, 0)
#define PTE18_FXIO_D4_I                 NXP_S32_PINMUX(0, 146, 0, 156, 4)
#define PTE24_FXIO_D5_O                 NXP_S32_PINMUX(0, 152, 5, 0, 0)
#define PTE24_FXIO_D11_O                NXP_S32_PINMUX(0, 152, 7, 0, 0)
#define PTE24_FXIO_D5_I                 NXP_S32_PINMUX(0, 152, 0, 157, 10)
#define PTE24_FXIO_D11_I                NXP_S32_PINMUX(0, 152, 0, 163, 6)

