zephyrproject-rtos/hal_nxp/dts/nxp/s32/S32K344-172MQFP-pinctrl.h
/* EMIOS_1 */
#define PTA0_EMIOS_1_CH0_X_O            NXP_S32_PINMUX(0, 0, 5, 0, 0)
#define PTA0_EMIOS_1_CH0_X_I            NXP_S32_PINMUX(0, 0, 0, 80, 3)
#define PTA2_EMIOS_1_CH19_Y_O           NXP_S32_PINMUX(0, 2, 2, 0, 0)
#define PTA2_EMIOS_1_CH19_Y_I           NXP_S32_PINMUX(0, 2, 0, 99, 4)
#define PTA3_EMIOS_1_CH20_Y_O           NXP_S32_PINMUX(0, 3, 2, 0, 0)
#define PTA3_EMIOS_1_CH20_Y_I           NXP_S32_PINMUX(0, 3, 0, 100, 4)
#define PTA6_EMIOS_1_CH13_H_O           NXP_S32_PINMUX(0, 6, 4, 0, 0)
#define PTA6_EMIOS_1_CH13_H_I           NXP_S32_PINMUX(0, 6, 0, 93, 1)
#define PTA7_EMIOS_1_CH11_H_O           NXP_S32_PINMUX(0, 7, 3, 0, 0)
#define PTA7_EMIOS_1_CH11_H_I           NXP_S32_PINMUX(0, 7, 0, 91, 1)
#define PTA8_EMIOS_1_CH12_H_O           NXP_S32_PINMUX(0, 8, 2, 0, 0)
#define PTA8_EMIOS_1_CH12_H_I           NXP_S32_PINMUX(0, 8, 0, 92, 2)
#define PTA11_EMIOS_1_CH1_H_O           NXP_S32_PINMUX(0, 11, 3, 0, 0)
#define PTA11_EMIOS_1_CH1_H_I           NXP_S32_PINMUX(0, 11, 0, 81, 3)
#define PTA12_EMIOS_1_CH2_H_O           NXP_S32_PINMUX(0, 12, 6, 0, 0)
#define PTA12_EMIOS_1_CH2_H_I           NXP_S32_PINMUX(0, 12, 0, 82, 4)
#define PTA13_EMIOS_1_CH3_H_O           NXP_S32_PINMUX(0, 13, 6, 0, 0)
#define PTA13_EMIOS_1_CH3_H_I           NXP_S32_PINMUX(0, 13, 0, 83, 4)
#define PTA14_EMIOS_1_CH4_H_O           NXP_S32_PINMUX(0, 14, 2, 0, 0)
#define PTA14_EMIOS_1_CH4_H_I           NXP_S32_PINMUX(0, 14, 0, 84, 7)
#define PTA18_EMIOS_1_CH0_X_O           NXP_S32_PINMUX(0, 18, 2, 0, 0)
#define PTA18_EMIOS_1_CH16_X_O          NXP_S32_PINMUX(0, 18, 5, 0, 0)
#define PTA18_EMIOS_1_CH0_X_I           NXP_S32_PINMUX(0, 18, 0, 80, 1)
#define PTA18_EMIOS_1_CH16_X_I          NXP_S32_PINMUX(0, 18, 0, 96, 1)
#define PTA19_EMIOS_1_CH1_H_O           NXP_S32_PINMUX(0, 19, 2, 0, 0)
#define PTA19_EMIOS_1_CH1_H_I           NXP_S32_PINMUX(0, 19, 0, 81, 1)
#define PTA20_EMIOS_1_CH2_H_O           NXP_S32_PINMUX(0, 20, 2, 0, 0)
#define PTA20_EMIOS_1_CH2_H_I           NXP_S32_PINMUX(0, 20, 0, 82, 2)
#define PTA21_EMIOS_1_CH3_H_O           NXP_S32_PINMUX(0, 21, 2, 0, 0)
#define PTA21_EMIOS_1_CH3_H_I           NXP_S32_PINMUX(0, 21, 0, 83, 1)
#define PTA24_EMIOS_1_CH7_H             NXP_S32_PINMUX(0, 23, 0, 87, 2)
#define PTA25_EMIOS_1_CH8_X             NXP_S32_PINMUX(0, 23, 0, 88, 2)
#define PTA27_EMIOS_1_CH10_H_O          NXP_S32_PINMUX(0, 27, 2, 0, 0)
#define PTA27_EMIOS_1_CH10_H_I          NXP_S32_PINMUX(0, 27, 0, 90, 3)
#define PTA28_EMIOS_1_CH11_H_O          NXP_S32_PINMUX(0, 28, 2, 0, 0)
#define PTA28_EMIOS_1_CH11_H_I          NXP_S32_PINMUX(0, 28, 0, 91, 2)
#define PTA29_EMIOS_1_CH12_H_O          NXP_S32_PINMUX(0, 29, 2, 0, 0)
#define PTA29_EMIOS_1_CH12_H_I          NXP_S32_PINMUX(0, 29, 0, 92, 3)
#define PTA30_EMIOS_1_CH13_H_O          NXP_S32_PINMUX(0, 30, 2, 0, 0)
#define PTA30_EMIOS_1_CH13_H_I          NXP_S32_PINMUX(0, 30, 0, 93, 2)
#define PTA31_EMIOS_1_CH14_H_O          NXP_S32_PINMUX(0, 31, 2, 0, 0)
#define PTA31_EMIOS_1_CH14_H_I          NXP_S32_PINMUX(0, 31, 0, 94, 2)
#define PTB0_EMIOS_1_CH6_H_O            NXP_S32_PINMUX(0, 32, 6, 0, 0)
#define PTB0_EMIOS_1_CH6_H_I            NXP_S32_PINMUX(0, 32, 0, 86, 1)
#define PTB1_EMIOS_1_CH5_H_O            NXP_S32_PINMUX(0, 33, 6, 0, 0)
#define PTB1_EMIOS_1_CH5_H_I            NXP_S32_PINMUX(0, 33, 0, 85, 1)
#define PTB4_EMIOS_1_CH10_H_O           NXP_S32_PINMUX(0, 36, 6, 0, 0)
#define PTB4_EMIOS_1_CH10_H_I           NXP_S32_PINMUX(0, 36, 0, 90, 6)
#define PTB5_EMIOS_1_CH11_H_O           NXP_S32_PINMUX(0, 37, 6, 0, 0)
#define PTB5_EMIOS_1_CH11_H_I           NXP_S32_PINMUX(0, 37, 0, 91, 5)
#define PTB8_EMIOS_1_CH15_H_O           NXP_S32_PINMUX(0, 40, 2, 0, 0)
#define PTB8_EMIOS_1_CH15_H_I           NXP_S32_PINMUX(0, 40, 0, 95, 6)
#define PTB9_EMIOS_1_CH16_X_O           NXP_S32_PINMUX(0, 41, 2, 0, 0)
#define PTB9_EMIOS_1_CH16_X_I           NXP_S32_PINMUX(0, 41, 0, 96, 5)
#define PTB10_EMIOS_1_CH17_Y_O          NXP_S32_PINMUX(0, 42, 2, 0, 0)
#define PTB10_EMIOS_1_CH17_Y_I          NXP_S32_PINMUX(0, 42, 0, 97, 4)
#define PTB11_EMIOS_1_CH18_Y_O          NXP_S32_PINMUX(0, 43, 2, 0, 0)
#define PTB11_EMIOS_1_CH18_Y_I          NXP_S32_PINMUX(0, 43, 0, 98, 4)
#define PTB17_EMIOS_1_CH7_H_O           NXP_S32_PINMUX(0, 49, 4, 0, 0)
#define PTB17_EMIOS_1_CH7_H_I           NXP_S32_PINMUX(0, 49, 0, 87, 7)
#define PTB18_EMIOS_1_CH15_H_O          NXP_S32_PINMUX(0, 50, 2, 0, 0)
#define PTB18_EMIOS_1_CH15_H_I          NXP_S32_PINMUX(0, 50, 0, 95, 2)
#define PTB19_EMIOS_1_CH15_H_O          NXP_S32_PINMUX(0, 51, 2, 0, 0)
#define PTB19_EMIOS_1_CH15_H_I          NXP_S32_PINMUX(0, 51, 0, 95, 3)
#define PTB20_EMIOS_1_CH16_X_O          NXP_S32_PINMUX(0, 52, 2, 0, 0)
#define PTB20_EMIOS_1_CH16_X_I          NXP_S32_PINMUX(0, 52, 0, 96, 3)
#define PTB21_EMIOS_1_CH17_Y_O          NXP_S32_PINMUX(0, 53, 2, 0, 0)
#define PTB21_EMIOS_1_CH17_Y_I          NXP_S32_PINMUX(0, 53, 0, 97, 2)
#define PTB22_EMIOS_1_CH18_Y_O          NXP_S32_PINMUX(0, 54, 2, 0, 0)
#define PTB22_EMIOS_1_CH18_Y_I          NXP_S32_PINMUX(0, 54, 0, 98, 2)
#define PTB23_EMIOS_1_CH19_Y_O          NXP_S32_PINMUX(0, 55, 2, 0, 0)
#define PTB23_EMIOS_1_CH19_Y_I          NXP_S32_PINMUX(0, 55, 0, 99, 2)
#define PTB24_EMIOS_1_CH20_Y_O          NXP_S32_PINMUX(0, 56, 2, 0, 0)
#define PTB24_EMIOS_1_CH20_Y_I          NXP_S32_PINMUX(0, 56, 0, 100, 2)
#define PTB25_EMIOS_1_CH21_Y_O          NXP_S32_PINMUX(0, 57, 2, 0, 0)
#define PTB25_EMIOS_1_CH21_Y_I          NXP_S32_PINMUX(0, 57, 0, 101, 2)
#define PTB26_EMIOS_1_CH22_X_O          NXP_S32_PINMUX(0, 58, 2, 0, 0)
#define PTB26_EMIOS_1_CH22_X_I          NXP_S32_PINMUX(0, 58, 0, 102, 2)
#define PTB27_EMIOS_1_CH23_X_O          NXP_S32_PINMUX(0, 59, 2, 0, 0)
#define PTB27_EMIOS_1_CH23_X_I          NXP_S32_PINMUX(0, 59, 0, 103, 2)
#define PTC6_EMIOS_1_CH6_H_O            NXP_S32_PINMUX(0, 70, 5, 0, 0)
#define PTC6_EMIOS_1_CH6_H_I            NXP_S32_PINMUX(0, 70, 0, 86, 4)
#define PTC7_EMIOS_1_CH7_H_O            NXP_S32_PINMUX(0, 71, 5, 0, 0)
#define PTC7_EMIOS_1_CH7_H_I            NXP_S32_PINMUX(0, 71, 0, 87, 4)
#define PTC8_EMIOS_1_CH9_H_O            NXP_S32_PINMUX(0, 72, 4, 0, 0)
#define PTC8_EMIOS_1_CH9_H_I            NXP_S32_PINMUX(0, 72, 0, 89, 1)
#define PTC9_EMIOS_1_CH8_X_O            NXP_S32_PINMUX(0, 73, 4, 0, 0)
#define PTC9_EMIOS_1_CH8_X_I            NXP_S32_PINMUX(0, 73, 0, 88, 1)
#define PTC10_EMIOS_1_CH0_X_O           NXP_S32_PINMUX(0, 74, 7, 0, 0)
#define PTC10_EMIOS_1_CH0_X_I           NXP_S32_PINMUX(0, 74, 0, 80, 6)
#define PTC11_EMIOS_1_CH1_H_O           NXP_S32_PINMUX(0, 75, 3, 0, 0)
#define PTC11_EMIOS_1_CH1_H_I           NXP_S32_PINMUX(0, 75, 0, 81, 7)
#define PTC12_EMIOS_1_CH2_H_O           NXP_S32_PINMUX(0, 76, 2, 0, 0)
#define PTC12_EMIOS_1_CH2_H_I           NXP_S32_PINMUX(0, 76, 0, 82, 1)
#define PTC13_EMIOS_1_CH3_H_O           NXP_S32_PINMUX(0, 77, 2, 0, 0)
#define PTC13_EMIOS_1_CH3_H_I           NXP_S32_PINMUX(0, 77, 0, 83, 7)
#define PTC14_EMIOS_1_CH4_H_O           NXP_S32_PINMUX(0, 78, 5, 0, 0)
#define PTC14_EMIOS_1_CH4_H_I           NXP_S32_PINMUX(0, 78, 0, 84, 8)
#define PTC16_EMIOS_1_CH9_H_O           NXP_S32_PINMUX(0, 80, 2, 0, 0)
#define PTC16_EMIOS_1_CH9_H_I           NXP_S32_PINMUX(0, 80, 0, 89, 5)
#define PTC24_EMIOS_1_CH0_X_O           NXP_S32_PINMUX(0, 88, 2, 0, 0)
#define PTC24_EMIOS_1_CH0_X_I           NXP_S32_PINMUX(0, 88, 0, 80, 4)
#define PTC25_EMIOS_1_CH1_H_O           NXP_S32_PINMUX(0, 89, 2, 0, 0)
#define PTC25_EMIOS_1_CH1_H_I           NXP_S32_PINMUX(0, 89, 0, 81, 4)
#define PTC26_EMIOS_1_CH3_H_O           NXP_S32_PINMUX(0, 90, 2, 0, 0)
#define PTC26_EMIOS_1_CH3_H_I           NXP_S32_PINMUX(0, 90, 0, 83, 3)
#define PTC27_EMIOS_1_CH4_H_O           NXP_S32_PINMUX(0, 91, 2, 0, 0)
#define PTC27_EMIOS_1_CH4_H_I           NXP_S32_PINMUX(0, 91, 0, 84, 2)
#define PTC28_EMIOS_1_CH7_H_O           NXP_S32_PINMUX(0, 92, 2, 0, 0)
#define PTC28_EMIOS_1_CH7_H_I           NXP_S32_PINMUX(0, 92, 0, 87, 3)
#define PTC29_EMIOS_1_CH10_H_O          NXP_S32_PINMUX(0, 93, 2, 0, 0)
#define PTC29_EMIOS_1_CH10_H_I          NXP_S32_PINMUX(0, 93, 0, 90, 1)
#define PTC30_EMIOS_1_CH12_H_O          NXP_S32_PINMUX(0, 94, 2, 0, 0)
#define PTC30_EMIOS_1_CH12_H_I          NXP_S32_PINMUX(0, 94, 0, 92, 1)
#define PTC31_EMIOS_1_CH14_H_O          NXP_S32_PINMUX(0, 95, 2, 0, 0)
#define PTC31_EMIOS_1_CH14_H_I          NXP_S32_PINMUX(0, 95, 0, 94, 1)
#define PTD2_EMIOS_1_CH21_Y_O           NXP_S32_PINMUX(0, 98, 2, 0, 0)
#define PTD2_EMIOS_1_CH21_Y_I           NXP_S32_PINMUX(0, 98, 0, 101, 4)
#define PTD3_EMIOS_1_CH22_X_O           NXP_S32_PINMUX(0, 99, 2, 0, 0)
#define PTD3_EMIOS_1_CH22_X_I           NXP_S32_PINMUX(0, 99, 0, 102, 4)
#define PTD4_EMIOS_1_CH23_X_O           NXP_S32_PINMUX(0, 100, 2, 0, 0)
#define PTD4_EMIOS_1_CH23_X_I           NXP_S32_PINMUX(0, 100, 0, 103, 4)
#define PTD6_EMIOS_1_CH12_H_O           NXP_S32_PINMUX(0, 102, 3, 0, 0)
#define PTD6_EMIOS_1_CH12_H_I           NXP_S32_PINMUX(0, 102, 0, 92, 5)
#define PTD10_EMIOS_1_CH10_H_O          NXP_S32_PINMUX(0, 106, 3, 0, 0)
#define PTD10_EMIOS_1_CH10_H_I          NXP_S32_PINMUX(0, 106, 0, 90, 2)
#define PTD15_EMIOS_1_CH14_H_O          NXP_S32_PINMUX(0, 111, 3, 0, 0)
#define PTD15_EMIOS_1_CH14_H_I          NXP_S32_PINMUX(0, 111, 0, 94, 6)
#define PTD16_EMIOS_1_CH15_H_O          NXP_S32_PINMUX(0, 112, 5, 0, 0)
#define PTD16_EMIOS_1_CH15_H_I          NXP_S32_PINMUX(0, 112, 0, 95, 7)
#define PTD20_EMIOS_1_CH17_Y_O          NXP_S32_PINMUX(0, 116, 2, 0, 0)
#define PTD20_EMIOS_1_CH17_Y_I          NXP_S32_PINMUX(0, 116, 0, 97, 1)
#define PTD21_EMIOS_1_CH18_Y_O          NXP_S32_PINMUX(0, 117, 2, 0, 0)
#define PTD21_EMIOS_1_CH18_Y_I          NXP_S32_PINMUX(0, 117, 0, 98, 1)
#define PTD22_EMIOS_1_CH19_Y_O          NXP_S32_PINMUX(0, 118, 2, 0, 0)
#define PTD22_EMIOS_1_CH19_Y_I          NXP_S32_PINMUX(0, 118, 0, 99, 1)
#define PTD23_EMIOS_1_CH20_Y_O          NXP_S32_PINMUX(0, 119, 2, 0, 0)
#define PTD23_EMIOS_1_CH20_Y_I          NXP_S32_PINMUX(0, 119, 0, 100, 1)
#define PTD24_EMIOS_1_CH21_Y_O          NXP_S32_PINMUX(0, 120, 2, 0, 0)
#define PTD24_EMIOS_1_CH21_Y_I          NXP_S32_PINMUX(0, 120, 0, 101, 1)
#define PTD26_EMIOS_1_CH23_X_O          NXP_S32_PINMUX(0, 122, 2, 0, 0)
#define PTD26_EMIOS_1_CH23_X_I          NXP_S32_PINMUX(0, 122, 0, 103, 1)
#define PTE2_EMIOS_1_CH8_X_O            NXP_S32_PINMUX(0, 130, 4, 0, 0)
#define PTE2_EMIOS_1_CH8_X_I            NXP_S32_PINMUX(0, 130, 0, 88, 4)
#define PTE4_EMIOS_1_CH4_H_O            NXP_S32_PINMUX(0, 132, 3, 0, 0)
#define PTE4_EMIOS_1_CH4_H_I            NXP_S32_PINMUX(0, 132, 0, 84, 4)
#define PTE5_EMIOS_1_CH5_H_O            NXP_S32_PINMUX(0, 133, 3, 0, 0)
#define PTE5_EMIOS_1_CH5_H_I            NXP_S32_PINMUX(0, 133, 0, 85, 4)
#define PTE6_EMIOS_1_CH14_H_O           NXP_S32_PINMUX(0, 134, 4, 0, 0)
#define PTE6_EMIOS_1_CH14_H_I           NXP_S32_PINMUX(0, 134, 0, 94, 5)
#define PTE9_EMIOS_1_CH13_H_O           NXP_S32_PINMUX(0, 137, 3, 0, 0)
#define PTE9_EMIOS_1_CH13_H_I           NXP_S32_PINMUX(0, 137, 0, 93, 5)
#define PTE12_EMIOS_1_CH5_H_O           NXP_S32_PINMUX(0, 140, 4, 0, 0)
#define PTE12_EMIOS_1_CH5_H_I           NXP_S32_PINMUX(0, 140, 0, 85, 5)
#define PTE13_EMIOS_1_CH5_H_O           NXP_S32_PINMUX(0, 141, 2, 0, 0)
#define PTE13_EMIOS_1_CH5_H_I           NXP_S32_PINMUX(0, 141, 0, 85, 3)
#define PTE21_EMIOS_1_CH1_H_O           NXP_S32_PINMUX(0, 149, 2, 0, 0)
#define PTE21_EMIOS_1_CH1_H_I           NXP_S32_PINMUX(0, 149, 0, 81, 2)
#define PTE22_EMIOS_1_CH2_H_O           NXP_S32_PINMUX(0, 150, 2, 0, 0)
#define PTE22_EMIOS_1_CH2_H_I           NXP_S32_PINMUX(0, 150, 0, 82, 3)
#define PTE23_EMIOS_1_CH3_H_O           NXP_S32_PINMUX(0, 151, 2, 0, 0)
#define PTE23_EMIOS_1_CH3_H_I           NXP_S32_PINMUX(0, 151, 0, 83, 2)
#define PTE24_EMIOS_1_CH4_H_O           NXP_S32_PINMUX(0, 152, 2, 0, 0)
#define PTE24_EMIOS_1_CH4_H_I           NXP_S32_PINMUX(0, 152, 0, 84, 3)
#define PTE25_EMIOS_1_CH5_H_O           NXP_S32_PINMUX(0, 153, 2, 0, 0)
#define PTE25_EMIOS_1_CH5_H_I           NXP_S32_PINMUX(0, 153, 0, 85, 2)
#define PTE26_EMIOS_1_CH6_H_O           NXP_S32_PINMUX(0, 154, 2, 0, 0)
#define PTE26_EMIOS_1_CH6_H_I           NXP_S32_PINMUX(0, 154, 0, 86, 3)

/* LPSPI0 */
#define PTA0_LPSPI0_PCS7_O              NXP_S32_PINMUX(0, 0, 6, 0, 0)
#define PTA0_LPSPI0_PCS7_I              NXP_S32_PINMUX(0, 0, 0, 228, 1)
#define PTA1_LPSPI0_PCS6_O              NXP_S32_PINMUX(0, 1, 6, 0, 0)
#define PTA1_LPSPI0_PCS6_I              NXP_S32_PINMUX(0, 1, 0, 227, 1)
#define PTA7_LPSPI0_PCS1_O              NXP_S32_PINMUX(0, 7, 2, 0, 0)
#define PTA7_LPSPI0_PCS1_I              NXP_S32_PINMUX(0, 7, 0, 222, 3)
#define PTA15_LPSPI0_PCS3_O             NXP_S32_PINMUX(0, 15, 3, 0, 0)
#define PTA15_LPSPI0_PCS3_I             NXP_S32_PINMUX(0, 15, 0, 224, 1)
#define PTA16_LPSPI0_PCS4_O             NXP_S32_PINMUX(0, 16, 4, 0, 0)
#define PTA16_LPSPI0_PCS4_I             NXP_S32_PINMUX(0, 16, 0, 225, 1)
#define PTA30_LPSPI0_SOUT_O             NXP_S32_PINMUX(0, 30, 4, 0, 0)
#define PTA30_LPSPI0_SOUT_I             NXP_S32_PINMUX(0, 30, 0, 231, 4)
#define PTA31_LPSPI0_PCS1_O             NXP_S32_PINMUX(0, 31, 4, 0, 0)
#define PTA31_LPSPI0_PCS1_I             NXP_S32_PINMUX(0, 31, 0, 222, 2)
#define PTB0_LPSPI0_PCS0_O              NXP_S32_PINMUX(0, 32, 3, 0, 0)
#define PTB0_LPSPI0_PCS0_I              NXP_S32_PINMUX(0, 32, 0, 221, 1)
#define PTB1_LPSPI0_SOUT_O              NXP_S32_PINMUX(0, 33, 3, 0, 0)
#define PTB1_LPSPI0_SOUT_I              NXP_S32_PINMUX(0, 33, 0, 231, 3)
#define PTB4_LPSPI0_SOUT_O              NXP_S32_PINMUX(0, 36, 3, 0, 0)
#define PTB4_LPSPI0_SOUT_I              NXP_S32_PINMUX(0, 36, 0, 231, 2)
#define PTB5_LPSPI0_PCS1_O              NXP_S32_PINMUX(0, 37, 3, 0, 0)
#define PTB5_LPSPI0_PCS0_O              NXP_S32_PINMUX(0, 37, 4, 0, 0)
#define PTB5_LPSPI0_PCS0_I              NXP_S32_PINMUX(0, 37, 0, 221, 2)
#define PTB5_LPSPI0_PCS1_I              NXP_S32_PINMUX(0, 37, 0, 222, 1)
#define PTB8_LPSPI0_PCS5_O              NXP_S32_PINMUX(0, 40, 6, 0, 0)
#define PTB8_LPSPI0_PCS5_I              NXP_S32_PINMUX(0, 40, 0, 226, 1)
#define PTC2_LPSPI0_PCS2_O              NXP_S32_PINMUX(0, 66, 4, 0, 0)
#define PTC2_LPSPI0_PCS2_I              NXP_S32_PINMUX(0, 66, 0, 223, 2)
#define PTC6_LPSPI0_PCS1_O              NXP_S32_PINMUX(0, 70, 6, 0, 0)
#define PTC6_LPSPI0_PCS1_I              NXP_S32_PINMUX(0, 70, 0, 222, 4)
#define PTC7_LPSPI0_PCS0_O              NXP_S32_PINMUX(0, 71, 6, 0, 0)
#define PTC7_LPSPI0_PCS0_I              NXP_S32_PINMUX(0, 71, 0, 221, 6)
#define PTC8_LPSPI0_SCK_O               NXP_S32_PINMUX(0, 72, 6, 0, 0)
#define PTC8_LPSPI0_SCK_I               NXP_S32_PINMUX(0, 72, 0, 229, 1)
#define PTC9_LPSPI0_SIN_O               NXP_S32_PINMUX(0, 73, 6, 0, 0)
#define PTC9_LPSPI0_SIN_I               NXP_S32_PINMUX(0, 73, 0, 230, 2)
#define PTD5_LPSPI0_PCS1_O              NXP_S32_PINMUX(0, 101, 7, 0, 0)
#define PTD5_LPSPI0_PCS1_I              NXP_S32_PINMUX(0, 101, 0, 222, 5)
#define PTD6_LPSPI0_PCS0_O              NXP_S32_PINMUX(0, 102, 7, 0, 0)
#define PTD6_LPSPI0_PCS0_I              NXP_S32_PINMUX(0, 102, 0, 221, 7)
#define PTD7_LPSPI0_PCS3_O              NXP_S32_PINMUX(0, 103, 4, 0, 0)
#define PTD7_LPSPI0_PCS3_I              NXP_S32_PINMUX(0, 103, 0, 224, 2)
#define PTD10_LPSPI0_SIN_O              NXP_S32_PINMUX(0, 106, 5, 0, 0)
#define PTD10_LPSPI0_SIN_I              NXP_S32_PINMUX(0, 106, 0, 230, 4)
#define PTD11_LPSPI0_SCK_O              NXP_S32_PINMUX(0, 107, 6, 0, 0)
#define PTD11_LPSPI0_SCK_I              NXP_S32_PINMUX(0, 107, 0, 229, 5)
#define PTD12_LPSPI0_SOUT_O             NXP_S32_PINMUX(0, 108, 6, 0, 0)
#define PTD12_LPSPI0_SOUT_I             NXP_S32_PINMUX(0, 108, 0, 231, 5)
#define PTD15_LPSPI0_SCK_O              NXP_S32_PINMUX(0, 111, 4, 0, 0)
#define PTD15_LPSPI0_SCK_I              NXP_S32_PINMUX(0, 111, 0, 229, 3)
#define PTD16_LPSPI0_SIN_O              NXP_S32_PINMUX(0, 112, 4, 0, 0)
#define PTD16_LPSPI0_SIN_I              NXP_S32_PINMUX(0, 112, 0, 230, 3)
#define PTE0_LPSPI0_SIN_O               NXP_S32_PINMUX(0, 128, 2, 0, 0)
#define PTE0_LPSPI0_SIN_I               NXP_S32_PINMUX(0, 128, 0, 230, 1)
#define PTE1_LPSPI0_SCK_O               NXP_S32_PINMUX(0, 129, 2, 0, 0)
#define PTE1_LPSPI0_SCK_I               NXP_S32_PINMUX(0, 129, 0, 229, 2)
#define PTE2_LPSPI0_SOUT_O              NXP_S32_PINMUX(0, 130, 2, 0, 0)
#define PTE2_LPSPI0_SOUT_I              NXP_S32_PINMUX(0, 130, 0, 231, 1)
#define PTE4_LPSPI0_PCS0_O              NXP_S32_PINMUX(0, 132, 1, 0, 0)
#define PTE4_LPSPI0_PCS0_I              NXP_S32_PINMUX(0, 132, 0, 221, 5)
#define PTE6_LPSPI0_PCS2_O              NXP_S32_PINMUX(0, 134, 2, 0, 0)
#define PTE6_LPSPI0_PCS2_I              NXP_S32_PINMUX(0, 134, 0, 223, 1)

/* TRGMUX */
#define PTA0_TRGMUX_OUT3                NXP_S32_PINMUX(0, 0, 7, 0, 0)
#define PTA1_TRGMUX_OUT0                NXP_S32_PINMUX(0, 1, 7, 0, 0)
#define PTA18_TRGMUX_IN12               NXP_S32_PINMUX(0, 18, 0, 356, 1)
#define PTA19_TRGMUX_IN13               NXP_S32_PINMUX(0, 19, 0, 357, 1)
#define PTA20_TRGMUX_IN14               NXP_S32_PINMUX(0, 20, 0, 358, 1)
#define PTA21_TRGMUX_IN15               NXP_S32_PINMUX(0, 21, 0, 359, 1)
#define PTA31_TRGMUX_OUT8               NXP_S32_PINMUX(0, 31, 7, 0, 0)
#define PTB2_TRGMUX_IN3                 NXP_S32_PINMUX(0, 34, 0, 347, 1)
#define PTB3_TRGMUX_IN2                 NXP_S32_PINMUX(0, 35, 0, 346, 1)
#define PTB4_TRGMUX_IN1                 NXP_S32_PINMUX(0, 36, 0, 345, 1)
#define PTB5_TRGMUX_IN0                 NXP_S32_PINMUX(0, 37, 0, 344, 1)
#define PTB18_TRGMUX_OUT9               NXP_S32_PINMUX(0, 50, 7, 0, 0)
#define PTB19_TRGMUX_OUT10              NXP_S32_PINMUX(0, 51, 7, 0, 0)
#define PTB20_TRGMUX_OUT11              NXP_S32_PINMUX(0, 52, 7, 0, 0)
#define PTB21_TRGMUX_OUT12              NXP_S32_PINMUX(0, 53, 7, 0, 0)
#define PTB22_TRGMUX_OUT13              NXP_S32_PINMUX(0, 54, 7, 0, 0)
#define PTB23_TRGMUX_OUT14              NXP_S32_PINMUX(0, 55, 7, 0, 0)
#define PTC10_TRGMUX_IN11               NXP_S32_PINMUX(0, 74, 0, 355, 1)
#define PTC11_TRGMUX_IN10               NXP_S32_PINMUX(0, 75, 0, 354, 1)
#define PTC14_TRGMUX_IN9                NXP_S32_PINMUX(0, 78, 0, 353, 1)
#define PTC15_TRGMUX_IN8                NXP_S32_PINMUX(0, 79, 0, 352, 1)
#define PTC24_TRGMUX_OUT15              NXP_S32_PINMUX(0, 88, 7, 0, 0)
#define PTD0_TRGMUX_OUT1                NXP_S32_PINMUX(0, 96, 7, 0, 0)
#define PTD1_TRGMUX_OUT2                NXP_S32_PINMUX(0, 97, 7, 0, 0)
#define PTD2_TRGMUX_IN5                 NXP_S32_PINMUX(0, 98, 0, 349, 1)
#define PTD3_TRGMUX_IN4                 NXP_S32_PINMUX(0, 99, 0, 348, 1)
#define PTD5_TRGMUX_IN7                 NXP_S32_PINMUX(0, 101, 0, 351, 1)
#define PTE3_TRGMUX_IN6                 NXP_S32_PINMUX(0, 131, 0, 350, 1)
#define PTE10_TRGMUX_OUT4               NXP_S32_PINMUX(0, 138, 7, 0, 0)
#define PTE11_TRGMUX_OUT5               NXP_S32_PINMUX(0, 139, 7, 0, 0)
#define PTE15_TRGMUX_OUT6               NXP_S32_PINMUX(0, 143, 7, 0, 0)
#define PTE16_TRGMUX_OUT7               NXP_S32_PINMUX(0, 144, 7, 0, 0)

