zephyrproject-rtos/hal_nxp/dts/nxp/s32/S32K344-172MQFP-pinctrl.h
/* SYSTEM */
#define PTA12_CLKOUT_STANDBY            NXP_S32_PINMUX(0, 12, 3, 0, 0)
#define PTB5_CLKOUT_RUN                 NXP_S32_PINMUX(0, 37, 5, 0, 0)
#define PTD10_CLKOUT_RUN                NXP_S32_PINMUX(0, 106, 6, 0, 0)
#define PTD14_CLKOUT_RUN                NXP_S32_PINMUX(0, 110, 7, 0, 0)
#define PTE10_CLKOUT_STANDBY            NXP_S32_PINMUX(0, 138, 5, 0, 0)

/* LPSPI3 */
#define PTA6_LPSPI3_PCS1_O              NXP_S32_PINMUX(0, 6, 6, 0, 0)
#define PTA6_LPSPI3_PCS1_I              NXP_S32_PINMUX(0, 6, 0, 249, 5)
#define PTA9_LPSPI3_PCS0_O              NXP_S32_PINMUX(0, 9, 6, 0, 0)
#define PTA9_LPSPI3_PCS0_I              NXP_S32_PINMUX(0, 9, 0, 248, 3)
#define PTA17_LPSPI3_SOUT_O             NXP_S32_PINMUX(0, 17, 6, 0, 0)
#define PTA17_LPSPI3_SOUT_I             NXP_S32_PINMUX(0, 17, 0, 254, 2)
#define PTB12_LPSPI3_PCS3_O             NXP_S32_PINMUX(0, 44, 1, 0, 0)
#define PTB12_LPSPI3_PCS3_I             NXP_S32_PINMUX(0, 44, 0, 251, 1)
#define PTB13_LPSPI3_PCS2_O             NXP_S32_PINMUX(0, 45, 1, 0, 0)
#define PTB13_LPSPI3_PCS2_I             NXP_S32_PINMUX(0, 45, 0, 250, 1)
#define PTB17_LPSPI3_PCS0_O             NXP_S32_PINMUX(0, 49, 6, 0, 0)
#define PTB17_LPSPI3_PCS0_I             NXP_S32_PINMUX(0, 49, 0, 248, 2)
#define PTB22_LPSPI3_PCS1_O             NXP_S32_PINMUX(0, 54, 3, 0, 0)
#define PTB22_LPSPI3_PCS1_I             NXP_S32_PINMUX(0, 54, 0, 249, 4)
#define PTC2_LPSPI3_PCS2_O              NXP_S32_PINMUX(0, 66, 3, 0, 0)
#define PTC2_LPSPI3_PCS2_I              NXP_S32_PINMUX(0, 66, 0, 250, 4)
#define PTC16_LPSPI3_SIN_O              NXP_S32_PINMUX(0, 80, 1, 0, 0)
#define PTC16_LPSPI3_SIN_I              NXP_S32_PINMUX(0, 80, 0, 253, 3)
#define PTC17_LPSPI3_SCK_O              NXP_S32_PINMUX(0, 81, 1, 0, 0)
#define PTC17_LPSPI3_SCK_I              NXP_S32_PINMUX(0, 81, 0, 252, 3)
#define PTD0_LPSPI3_SOUT_O              NXP_S32_PINMUX(0, 96, 3, 0, 0)
#define PTD0_LPSPI3_SOUT_I              NXP_S32_PINMUX(0, 96, 0, 254, 1)
#define PTD1_LPSPI3_SCK_O               NXP_S32_PINMUX(0, 97, 3, 0, 0)
#define PTD1_LPSPI3_SCK_I               NXP_S32_PINMUX(0, 97, 0, 252, 1)
#define PTD7_LPSPI3_PCS3_O              NXP_S32_PINMUX(0, 103, 3, 0, 0)
#define PTD7_LPSPI3_PCS3_I              NXP_S32_PINMUX(0, 103, 0, 251, 5)
#define PTD8_LPSPI3_SOUT_O              NXP_S32_PINMUX(0, 104, 1, 0, 0)
#define PTD8_LPSPI3_SOUT_I              NXP_S32_PINMUX(0, 104, 0, 254, 3)
#define PTD17_LPSPI3_PCS0_O             NXP_S32_PINMUX(0, 113, 5, 0, 0)
#define PTD17_LPSPI3_PCS0_I             NXP_S32_PINMUX(0, 113, 0, 248, 1)
#define PTD20_LPSPI3_SIN_O              NXP_S32_PINMUX(0, 116, 6, 0, 0)
#define PTD20_LPSPI3_SIN_I              NXP_S32_PINMUX(0, 116, 0, 253, 2)
#define PTE7_LPSPI3_SCK_O               NXP_S32_PINMUX(0, 135, 6, 0, 0)
#define PTE7_LPSPI3_SCK_I               NXP_S32_PINMUX(0, 135, 0, 252, 2)
#define PTE8_LPSPI3_PCS1_O              NXP_S32_PINMUX(0, 136, 1, 0, 0)
#define PTE8_LPSPI3_PCS1_I              NXP_S32_PINMUX(0, 136, 0, 249, 1)
#define PTE10_LPSPI3_SIN_O              NXP_S32_PINMUX(0, 138, 2, 0, 0)
#define PTE10_LPSPI3_SIN_I              NXP_S32_PINMUX(0, 138, 0, 253, 1)

/* CAN0 */
#define PTA6_CAN0_RX                    NXP_S32_PINMUX(0, 6, 0, 0, 2)
#define PTA7_CAN0_TX                    NXP_S32_PINMUX(0, 7, 4, 0, 0)
#define PTA27_CAN0_TX                   NXP_S32_PINMUX(0, 27, 5, 0, 0)
#define PTA28_CAN0_RX                   NXP_S32_PINMUX(0, 28, 0, 0, 4)
#define PTB0_CAN0_RX                    NXP_S32_PINMUX(0, 32, 0, 0, 3)
#define PTB1_CAN0_TX                    NXP_S32_PINMUX(0, 33, 5, 0, 0)
#define PTC2_CAN0_RX                    NXP_S32_PINMUX(0, 66, 0, 0, 1)
#define PTC3_CAN0_TX                    NXP_S32_PINMUX(0, 67, 3, 0, 0)

/* LPUART3 */
#define PTA6_LPUART3_RX                 NXP_S32_PINMUX(0, 6, 0, 190, 2)
#define PTA7_LPUART3_TX_O               NXP_S32_PINMUX(0, 7, 1, 0, 0)
#define PTA7_LPUART3_TX_I               NXP_S32_PINMUX(0, 7, 0, 366, 1)
#define PTD2_LPUART3_TX_O               NXP_S32_PINMUX(0, 98, 6, 0, 0)
#define PTD2_LPUART3_TX_I               NXP_S32_PINMUX(0, 98, 0, 366, 2)
#define PTD3_LPUART3_RX                 NXP_S32_PINMUX(0, 99, 0, 190, 3)
#define PTE15_LPUART3_RX                NXP_S32_PINMUX(0, 143, 0, 190, 1)
#define PTE16_LPUART3_TX_O              NXP_S32_PINMUX(0, 144, 2, 0, 0)
#define PTE16_LPUART3_TX_I              NXP_S32_PINMUX(0, 144, 0, 366, 3)

/* LPUART1 */
#define PTA6_LPUART1_CTS                NXP_S32_PINMUX(0, 6, 0, 361, 2)
#define PTA7_LPUART1_RTS                NXP_S32_PINMUX(0, 7, 5, 0, 0)
#define PTA18_LPUART1_TX_O              NXP_S32_PINMUX(0, 18, 3, 0, 0)
#define PTA18_LPUART1_TX_I              NXP_S32_PINMUX(0, 18, 0, 364, 4)
#define PTA19_LPUART1_RX                NXP_S32_PINMUX(0, 19, 0, 188, 5)
#define PTB22_LPUART1_TX_O              NXP_S32_PINMUX(0, 54, 5, 0, 0)
#define PTB22_LPUART1_TX_I              NXP_S32_PINMUX(0, 54, 0, 364, 5)
#define PTB23_LPUART1_RX                NXP_S32_PINMUX(0, 55, 0, 188, 4)
#define PTC6_LPUART1_RX                 NXP_S32_PINMUX(0, 70, 0, 188, 1)
#define PTC7_LPUART1_TX_O               NXP_S32_PINMUX(0, 71, 2, 0, 0)
#define PTC7_LPUART1_TX_I               NXP_S32_PINMUX(0, 71, 0, 364, 1)
#define PTC8_LPUART1_RX                 NXP_S32_PINMUX(0, 72, 0, 188, 2)
#define PTC9_LPUART1_TX_O               NXP_S32_PINMUX(0, 73, 2, 0, 0)
#define PTC9_LPUART1_TX_I               NXP_S32_PINMUX(0, 73, 0, 364, 2)
#define PTD13_LPUART1_RX                NXP_S32_PINMUX(0, 109, 0, 188, 3)
#define PTD14_LPUART1_TX_O              NXP_S32_PINMUX(0, 110, 3, 0, 0)
#define PTD14_LPUART1_TX_I              NXP_S32_PINMUX(0, 110, 0, 364, 3)
#define PTE2_LPUART1_CTS                NXP_S32_PINMUX(0, 130, 0, 361, 1)
#define PTE6_LPUART1_RTS                NXP_S32_PINMUX(0, 134, 3, 0, 0)
#define PTE15_LPUART1_CTS               NXP_S32_PINMUX(0, 143, 0, 361, 3)
#define PTE16_LPUART1_RTS               NXP_S32_PINMUX(0, 144, 5, 0, 0)

/* LPSPI2 */
#define PTA8_LPSPI2_SOUT_O              NXP_S32_PINMUX(0, 8, 3, 0, 0)
#define PTA8_LPSPI2_SOUT_I              NXP_S32_PINMUX(0, 8, 0, 247, 1)
#define PTA9_LPSPI2_PCS0_O              NXP_S32_PINMUX(0, 9, 3, 0, 0)
#define PTA9_LPSPI2_PCS0_I              NXP_S32_PINMUX(0, 9, 0, 241, 1)
#define PTA15_LPSPI2_PCS3_O             NXP_S32_PINMUX(0, 15, 4, 0, 0)
#define PTA15_LPSPI2_PCS3_I             NXP_S32_PINMUX(0, 15, 0, 244, 1)
#define PTA21_LPSPI2_PCS2_O             NXP_S32_PINMUX(0, 21, 1, 0, 0)
#define PTA21_LPSPI2_PCS2_I             NXP_S32_PINMUX(0, 21, 0, 243, 1)
#define PTB2_LPSPI2_SIN_O               NXP_S32_PINMUX(0, 34, 3, 0, 0)
#define PTB2_LPSPI2_SIN_I               NXP_S32_PINMUX(0, 34, 0, 246, 2)
#define PTB3_LPSPI2_SOUT_O              NXP_S32_PINMUX(0, 35, 3, 0, 0)
#define PTB3_LPSPI2_SOUT_I              NXP_S32_PINMUX(0, 35, 0, 247, 2)
#define PTB25_LPSPI2_PCS0_O             NXP_S32_PINMUX(0, 57, 5, 0, 0)
#define PTB25_LPSPI2_PCS0_I             NXP_S32_PINMUX(0, 57, 0, 241, 4)
#define PTB27_LPSPI2_SOUT_O             NXP_S32_PINMUX(0, 59, 5, 0, 0)
#define PTB27_LPSPI2_SOUT_I             NXP_S32_PINMUX(0, 59, 0, 247, 3)
#define PTB28_LPSPI2_SIN_O              NXP_S32_PINMUX(0, 60, 5, 0, 0)
#define PTB28_LPSPI2_SIN_I              NXP_S32_PINMUX(0, 60, 0, 246, 3)
#define PTB29_LPSPI2_SCK_O              NXP_S32_PINMUX(0, 61, 5, 0, 0)
#define PTB29_LPSPI2_SCK_I              NXP_S32_PINMUX(0, 61, 0, 245, 3)
#define PTC10_LPSPI2_PCS1_O             NXP_S32_PINMUX(0, 74, 4, 0, 0)
#define PTC10_LPSPI2_PCS1_I             NXP_S32_PINMUX(0, 74, 0, 242, 3)
#define PTC12_LPSPI2_PCS1_O             NXP_S32_PINMUX(0, 76, 4, 0, 0)
#define PTC12_LPSPI2_PCS1_I             NXP_S32_PINMUX(0, 76, 0, 242, 4)
#define PTC14_LPSPI2_PCS0_O             NXP_S32_PINMUX(0, 78, 3, 0, 0)
#define PTC14_LPSPI2_PCS0_I             NXP_S32_PINMUX(0, 78, 0, 241, 2)
#define PTC15_LPSPI2_SCK_O              NXP_S32_PINMUX(0, 79, 3, 0, 0)
#define PTC15_LPSPI2_SCK_I              NXP_S32_PINMUX(0, 79, 0, 245, 2)
#define PTC19_LPSPI2_PCS1_O             NXP_S32_PINMUX(0, 83, 5, 0, 0)
#define PTC19_LPSPI2_PCS1_I             NXP_S32_PINMUX(0, 83, 0, 242, 2)
#define PTE10_LPSPI2_PCS1_O             NXP_S32_PINMUX(0, 138, 3, 0, 0)
#define PTE10_LPSPI2_PCS1_I             NXP_S32_PINMUX(0, 138, 0, 242, 1)
#define PTE11_LPSPI2_PCS0_O             NXP_S32_PINMUX(0, 139, 2, 0, 0)
#define PTE11_LPSPI2_PCS0_I             NXP_S32_PINMUX(0, 139, 0, 241, 3)
#define PTE13_LPSPI2_PCS2_O             NXP_S32_PINMUX(0, 141, 3, 0, 0)
#define PTE13_LPSPI2_PCS0_O             NXP_S32_PINMUX(0, 141, 5, 0, 0)
#define PTE13_LPSPI2_PCS0_I             NXP_S32_PINMUX(0, 141, 0, 241, 5)
#define PTE13_LPSPI2_PCS2_I             NXP_S32_PINMUX(0, 141, 0, 243, 2)
#define PTE15_LPSPI2_SCK_O              NXP_S32_PINMUX(0, 143, 3, 0, 0)
#define PTE15_LPSPI2_SCK_I              NXP_S32_PINMUX(0, 143, 0, 245, 1)
#define PTE16_LPSPI2_SIN_O              NXP_S32_PINMUX(0, 144, 3, 0, 0)
#define PTE16_LPSPI2_SIN_I              NXP_S32_PINMUX(0, 144, 0, 246, 1)

/* EMIOS_2 */
#define PTA8_EMIOS_2_CH7_H_O            NXP_S32_PINMUX(0, 8, 6, 0, 0)
#define PTA8_EMIOS_2_CH7_H_I            NXP_S32_PINMUX(0, 8, 0, 119, 3)
#define PTA14_EMIOS_2_CH18_Y_O          NXP_S32_PINMUX(0, 14, 4, 0, 0)
#define PTA14_EMIOS_2_CH18_Y_I          NXP_S32_PINMUX(0, 14, 0, 130, 4)
#define PTA18_EMIOS_2_CH0_X_O           NXP_S32_PINMUX(0, 18, 6, 0, 0)
#define PTA18_EMIOS_2_CH0_X_I           NXP_S32_PINMUX(0, 18, 0, 112, 2)
#define PTA19_EMIOS_2_CH1_H_O           NXP_S32_PINMUX(0, 19, 6, 0, 0)
#define PTA19_EMIOS_2_CH1_H_I           NXP_S32_PINMUX(0, 19, 0, 113, 2)
#define PTA20_EMIOS_2_CH2_H_O           NXP_S32_PINMUX(0, 20, 6, 0, 0)
#define PTA20_EMIOS_2_CH2_H_I           NXP_S32_PINMUX(0, 20, 0, 114, 2)
#define PTA21_EMIOS_2_CH3_H_O           NXP_S32_PINMUX(0, 21, 6, 0, 0)
#define PTA21_EMIOS_2_CH3_H_I           NXP_S32_PINMUX(0, 21, 0, 115, 2)
#define PTA25_EMIOS_2_CH8_X             NXP_S32_PINMUX(0, 23, 0, 120, 2)
#define PTA27_EMIOS_2_CH10_H_O          NXP_S32_PINMUX(0, 27, 6, 0, 0)
#define PTA27_EMIOS_2_CH10_H_I          NXP_S32_PINMUX(0, 27, 0, 122, 2)
#define PTA28_EMIOS_2_CH11_H_O          NXP_S32_PINMUX(0, 28, 6, 0, 0)
#define PTA28_EMIOS_2_CH11_H_I          NXP_S32_PINMUX(0, 28, 0, 123, 2)
#define PTA29_EMIOS_2_CH12_H_O          NXP_S32_PINMUX(0, 29, 6, 0, 0)
#define PTA29_EMIOS_2_CH12_H_I          NXP_S32_PINMUX(0, 29, 0, 124, 1)
#define PTA30_EMIOS_2_CH13_H_O          NXP_S32_PINMUX(0, 30, 6, 0, 0)
#define PTA30_EMIOS_2_CH13_H_I          NXP_S32_PINMUX(0, 30, 0, 125, 2)
#define PTB18_EMIOS_2_CH14_H_O          NXP_S32_PINMUX(0, 50, 5, 0, 0)
#define PTB18_EMIOS_2_CH14_H_I          NXP_S32_PINMUX(0, 50, 0, 126, 2)
#define PTB19_EMIOS_2_CH15_H_O          NXP_S32_PINMUX(0, 51, 5, 0, 0)
#define PTB19_EMIOS_2_CH15_H_I          NXP_S32_PINMUX(0, 51, 0, 127, 3)
#define PTB20_EMIOS_2_CH16_X_O          NXP_S32_PINMUX(0, 52, 5, 0, 0)
#define PTB20_EMIOS_2_CH16_X_I          NXP_S32_PINMUX(0, 52, 0, 128, 2)
#define PTB21_EMIOS_2_CH17_Y_O          NXP_S32_PINMUX(0, 53, 5, 0, 0)
#define PTB21_EMIOS_2_CH17_Y_I          NXP_S32_PINMUX(0, 53, 0, 129, 2)
#define PTB22_EMIOS_2_CH18_Y_O          NXP_S32_PINMUX(0, 54, 4, 0, 0)
#define PTB22_EMIOS_2_CH18_Y_I          NXP_S32_PINMUX(0, 54, 0, 130, 2)
#define PTB23_EMIOS_2_CH19_Y_O          NXP_S32_PINMUX(0, 55, 4, 0, 0)
#define PTB23_EMIOS_2_CH19_Y_I          NXP_S32_PINMUX(0, 55, 0, 131, 2)
#define PTB24_EMIOS_2_CH20_Y_O          NXP_S32_PINMUX(0, 56, 4, 0, 0)
#define PTB24_EMIOS_2_CH20_Y_I          NXP_S32_PINMUX(0, 56, 0, 132, 2)
#define PTB25_EMIOS_2_CH21_Y_O          NXP_S32_PINMUX(0, 57, 4, 0, 0)
#define PTB25_EMIOS_2_CH21_Y_I          NXP_S32_PINMUX(0, 57, 0, 133, 2)
#define PTB26_EMIOS_2_CH22_X_O          NXP_S32_PINMUX(0, 58, 4, 0, 0)
#define PTB26_EMIOS_2_CH22_X_I          NXP_S32_PINMUX(0, 58, 0, 134, 2)
#define PTB27_EMIOS_2_CH23_X_O          NXP_S32_PINMUX(0, 59, 4, 0, 0)
#define PTB27_EMIOS_2_CH23_X_I          NXP_S32_PINMUX(0, 59, 0, 135, 2)
#define PTB28_EMIOS_2_CH10_H_O          NXP_S32_PINMUX(0, 60, 4, 0, 0)
#define PTB28_EMIOS_2_CH10_H_I          NXP_S32_PINMUX(0, 60, 0, 122, 3)
#define PTB29_EMIOS_2_CH11_H_O          NXP_S32_PINMUX(0, 61, 4, 0, 0)
#define PTB29_EMIOS_2_CH11_H_I          NXP_S32_PINMUX(0, 61, 0, 123, 3)
#define PTC16_EMIOS_2_CH9_H_O           NXP_S32_PINMUX(0, 80, 3, 0, 0)
#define PTC16_EMIOS_2_CH9_H_I           NXP_S32_PINMUX(0, 80, 0, 121, 4)
#define PTC18_EMIOS_2_CH12_H_O          NXP_S32_PINMUX(0, 82, 4, 0, 0)
#define PTC18_EMIOS_2_CH12_H_I          NXP_S32_PINMUX(0, 82, 0, 124, 3)
#define PTC19_EMIOS_2_CH13_H_O          NXP_S32_PINMUX(0, 83, 4, 0, 0)
#define PTC19_EMIOS_2_CH13_H_I          NXP_S32_PINMUX(0, 83, 0, 125, 3)
#define PTC20_EMIOS_2_CH14_H_O          NXP_S32_PINMUX(0, 84, 4, 0, 0)
#define PTC20_EMIOS_2_CH14_H_I          NXP_S32_PINMUX(0, 84, 0, 126, 3)
#define PTC21_EMIOS_2_CH15_H_O          NXP_S32_PINMUX(0, 85, 4, 0, 0)
#define PTC21_EMIOS_2_CH15_H_I          NXP_S32_PINMUX(0, 85, 0, 127, 5)
#define PTC24_EMIOS_2_CH0_X_O           NXP_S32_PINMUX(0, 88, 4, 0, 0)
#define PTC24_EMIOS_2_CH0_X_I           NXP_S32_PINMUX(0, 88, 0, 112, 5)
#define PTC25_EMIOS_2_CH1_H_O           NXP_S32_PINMUX(0, 89, 4, 0, 0)
#define PTC25_EMIOS_2_CH1_H_I           NXP_S32_PINMUX(0, 89, 0, 113, 3)
#define PTC26_EMIOS_2_CH2_H_O           NXP_S32_PINMUX(0, 90, 4, 0, 0)
#define PTC26_EMIOS_2_CH2_H_I           NXP_S32_PINMUX(0, 90, 0, 114, 3)
#define PTC27_EMIOS_2_CH3_H_O           NXP_S32_PINMUX(0, 91, 4, 0, 0)
#define PTC27_EMIOS_2_CH3_H_I           NXP_S32_PINMUX(0, 91, 0, 115, 3)
#define PTC29_EMIOS_2_CH4_H_O           NXP_S32_PINMUX(0, 93, 4, 0, 0)
#define PTC29_EMIOS_2_CH4_H_I           NXP_S32_PINMUX(0, 93, 0, 116, 2)
#define PTC30_EMIOS_2_CH5_H_O           NXP_S32_PINMUX(0, 94, 4, 0, 0)
#define PTC30_EMIOS_2_CH5_H_I           NXP_S32_PINMUX(0, 94, 0, 117, 3)
#define PTC31_EMIOS_2_CH6_H_O           NXP_S32_PINMUX(0, 95, 5, 0, 0)
#define PTC31_EMIOS_2_CH6_H_I           NXP_S32_PINMUX(0, 95, 0, 118, 2)
#define PTD20_EMIOS_2_CH0_X_O           NXP_S32_PINMUX(0, 116, 4, 0, 0)
#define PTD20_EMIOS_2_CH0_X_I           NXP_S32_PINMUX(0, 116, 0, 112, 3)
#define PTD21_EMIOS_2_CH8_X_O           NXP_S32_PINMUX(0, 117, 4, 0, 0)
#define PTD21_EMIOS_2_CH8_X_I           NXP_S32_PINMUX(0, 117, 0, 120, 3)
#define PTD22_EMIOS_2_CH22_X_O          NXP_S32_PINMUX(0, 118, 4, 0, 0)
#define PTD22_EMIOS_2_CH22_X_I          NXP_S32_PINMUX(0, 118, 0, 134, 3)
#define PTD23_EMIOS_2_CH23_X_O          NXP_S32_PINMUX(0, 119, 4, 0, 0)
#define PTD23_EMIOS_2_CH23_X_I          NXP_S32_PINMUX(0, 119, 0, 135, 3)
#define PTD26_EMIOS_2_CH7_H_O           NXP_S32_PINMUX(0, 122, 4, 0, 0)
#define PTD26_EMIOS_2_CH7_H_I           NXP_S32_PINMUX(0, 122, 0, 119, 1)
#define PTD27_EMIOS_2_CH9_H_O           NXP_S32_PINMUX(0, 123, 4, 0, 0)
#define PTD27_EMIOS_2_CH9_H_I           NXP_S32_PINMUX(0, 123, 0, 121, 3)
#define PTD28_EMIOS_2_CH0_X_O           NXP_S32_PINMUX(0, 124, 4, 0, 0)
#define PTD28_EMIOS_2_CH0_X_I           NXP_S32_PINMUX(0, 124, 0, 112, 4)
#define PTD29_EMIOS_2_CH8_X_O           NXP_S32_PINMUX(0, 125, 4, 0, 0)
#define PTD29_EMIOS_2_CH8_X_I           NXP_S32_PINMUX(0, 125, 0, 120, 4)
#define PTD30_EMIOS_2_CH16_X_O          NXP_S32_PINMUX(0, 126, 4, 0, 0)
#define PTD30_EMIOS_2_CH16_X_I          NXP_S32_PINMUX(0, 126, 0, 128, 3)
#define PTD31_EMIOS_2_CH22_X_O          NXP_S32_PINMUX(0, 127, 4, 0, 0)
#define PTD31_EMIOS_2_CH22_X_I          NXP_S32_PINMUX(0, 127, 0, 134, 4)
#define PTE17_EMIOS_2_CH23_X_O          NXP_S32_PINMUX(0, 145, 4, 0, 0)
#define PTE17_EMIOS_2_CH23_X_I          NXP_S32_PINMUX(0, 145, 0, 135, 4)
#define PTE18_EMIOS_2_CH17_Y_O          NXP_S32_PINMUX(0, 146, 4, 0, 0)
#define PTE18_EMIOS_2_CH17_Y_I          NXP_S32_PINMUX(0, 146, 0, 129, 4)
#define PTE21_EMIOS_2_CH19_Y_O          NXP_S32_PINMUX(0, 149, 4, 0, 0)
#define PTE21_EMIOS_2_CH19_Y_I          NXP_S32_PINMUX(0, 149, 0, 131, 4)
#define PTE22_EMIOS_2_CH20_Y_O          NXP_S32_PINMUX(0, 150, 4, 0, 0)
#define PTE22_EMIOS_2_CH20_Y_I          NXP_S32_PINMUX(0, 150, 0, 132, 4)
#define PTE23_EMIOS_2_CH21_Y_O          NXP_S32_PINMUX(0, 151, 4, 0, 0)
#define PTE23_EMIOS_2_CH21_Y_I          NXP_S32_PINMUX(0, 151, 0, 133, 4)
#define PTE24_EMIOS_2_CH4_H_O           NXP_S32_PINMUX(0, 152, 4, 0, 0)
#define PTE24_EMIOS_2_CH4_H_I           NXP_S32_PINMUX(0, 152, 0, 116, 3)
#define PTE25_EMIOS_2_CH5_H_O           NXP_S32_PINMUX(0, 153, 4, 0, 0)
#define PTE25_EMIOS_2_CH5_H_I           NXP_S32_PINMUX(0, 153, 0, 117, 2)
#define PTE26_EMIOS_2_CH6_H_O           NXP_S32_PINMUX(0, 154, 4, 0, 0)
#define PTE26_EMIOS_2_CH6_H_I           NXP_S32_PINMUX(0, 154, 0, 118, 3)

/* LPUART2 */
#define PTA8_LPUART2_RX                 NXP_S32_PINMUX(0, 8, 0, 189, 3)
#define PTA9_LPUART2_TX_O               NXP_S32_PINMUX(0, 9, 2, 0, 0)
#define PTA9_LPUART2_TX_I               NXP_S32_PINMUX(0, 9, 0, 365, 1)
#define PTA29_LPUART2_TX_O              NXP_S32_PINMUX(0, 29, 4, 0, 0)
#define PTA29_LPUART2_TX_I              NXP_S32_PINMUX(0, 29, 0, 365, 5)
#define PTA30_LPUART2_RX                NXP_S32_PINMUX(0, 30, 0, 189, 4)
#define PTC15_LPUART2_TX_O              NXP_S32_PINMUX(0, 79, 5, 0, 0)
#define PTC15_LPUART2_TX_I              NXP_S32_PINMUX(0, 79, 0, 365, 2)
#define PTC16_LPUART2_RX                NXP_S32_PINMUX(0, 80, 0, 189, 5)
#define PTD6_LPUART2_RX                 NXP_S32_PINMUX(0, 102, 0, 189, 1)
#define PTD7_LPUART2_TX_O               NXP_S32_PINMUX(0, 103, 2, 0, 0)
#define PTD7_LPUART2_TX_I               NXP_S32_PINMUX(0, 103, 0, 365, 3)
#define PTD11_LPUART2_CTS               NXP_S32_PINMUX(0, 107, 0, 362, 1)
#define PTD12_LPUART2_RTS               NXP_S32_PINMUX(0, 108, 3, 0, 0)
#define PTD15_LPUART2_CTS               NXP_S32_PINMUX(0, 111, 0, 362, 2)
#define PTD16_LPUART2_RTS               NXP_S32_PINMUX(0, 112, 6, 0, 0)
#define PTD17_LPUART2_RX                NXP_S32_PINMUX(0, 113, 0, 189, 2)
#define PTE3_LPUART2_RTS                NXP_S32_PINMUX(0, 131, 5, 0, 0)
#define PTE9_LPUART2_CTS                NXP_S32_PINMUX(0, 137, 0, 362, 3)
#define PTE12_LPUART2_TX_O              NXP_S32_PINMUX(0, 140, 3, 0, 0)
#define PTE12_LPUART2_TX_I              NXP_S32_PINMUX(0, 140, 0, 365, 4)

/* CMP2 */
#define PTA9_CMP2_OUT                   NXP_S32_PINMUX(0, 9, 7, 0, 0)
#define PTC5_CMP2_RRT                   NXP_S32_PINMUX(0, 69, 5, 0, 0)

/* JTAGTRACENOETM */
#define PTA10_JTAG_TDOTRACENOETM_SWO    NXP_S32_PINMUX(0, 10, 7, 0, 0)

